CSI API ETABS v1
cAnalysisResults.SectionCutAnalysis Method
 Reports the section cut force for sections cuts that are specified to have an Analysis (F1, F2, F3, M1, M2, M3) result type
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SectionCutAnalysis(
	ref int NumberResults,
	ref string[] SCut,
	ref string[] LoadCase,
	ref string[] StepType,
	ref double[] StepNum,
	ref double[] F1,
	ref double[] F2,
	ref double[] F3,
	ref double[] M1,
	ref double[] M2,
	ref double[] M3
)
Function SectionCutAnalysis (
	ByRef NumberResults As Integer,
	ByRef SCut As String(),
	ByRef LoadCase As String(),
	ByRef StepType As String(),
	ByRef StepNum As Double(),
	ByRef F1 As Double(),
	ByRef F2 As Double(),
	ByRef F3 As Double(),
	ByRef M1 As Double(),
	ByRef M2 As Double(),
	ByRef M3 As Double()
) As Integer
Dim instance As cAnalysisResults
Dim NumberResults As Integer
Dim SCut As String()
Dim LoadCase As String()
Dim StepType As String()
Dim StepNum As Double()
Dim F1 As Double()
Dim F2 As Double()
Dim F3 As Double()
Dim M1 As Double()
Dim M2 As Double()
Dim M3 As Double()
Dim returnValue As Integer
returnValue = instance.SectionCutAnalysis(NumberResults,
	SCut, LoadCase, StepType, StepNum,
	F1, F2, F3, M1, M2, M3)
int SectionCutAnalysis(
	int% NumberResults,
	array<String^>^% SCut,
	array<String^>^% LoadCase,
	array<String^>^% StepType,
	array<double>^% StepNum,
	array<double>^% F1,
	array<double>^% F2,
	array<double>^% F3,
	array<double>^% M1,
	array<double>^% M2,
	array<double>^% M3
)
abstract SectionCutAnalysis :
        NumberResults : int byref *
        SCut : string[] byref *
        LoadCase : string[] byref *
        StepType : string[] byref *
        StepNum : float[] byref *
        F1 : float[] byref *
        F2 : float[] byref *
        F3 : float[] byref *
        M1 : float[] byref *
        M2 : float[] byref *
        M3 : float[] byref -> int
Parameters
NumberResults
Type: System.Int32
 The number total of results returned by the program
SCut
Type: System.String[]
 This is an array that includes the name of the section cut associated with each result
LoadCase
Type: System.String[]
 This is an array that includes the name of the analysis case or load combination associated with each result.
StepType
Type: System.String[]
 This is an array that includes the step type, if any, for each result.
StepNum
Type: System.Double[]
 This is an array that includes the step number, if any, for each result.
F1
Type: System.Double[]
 This is an array that includes the force in the section cut local 1-axis directions for each result. [F]
F2
Type: System.Double[]
 This is an array that includes the force in the section cut local 2-axis directions for each result. [F]
F3
Type: System.Double[]
 This is an array that includes the force in the section cut local 3-axis directions for each result. [F]
M1
Type: System.Double[]
 This is an array that includes the moment about the section cut local 1-axis for each result. [FL]
M2
Type: System.Double[]
 This is an array that includes the moment about the section cut local 1-axis for each result. [FL]
M3
Type: System.Double[]
 This is an array that includes the moment about the section cut local 1-axis for each result. [FL]
Return Value
Type: Int32
 Returns zero if the section cut forces are successfully recovered, otherwise it returns a nonzero value
Remarks
 See Results for more information.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim NumberResults As Integer
       Dim SCut() As String
       Dim LoadCase() As String
       Dim StepType() As String
       Dim StepNum() As Double
       Dim F1() As Double
       Dim F2() As Double
       Dim F3() As Double
       Dim M1() As Double
       Dim M2() As Double
       Dim M3() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis()
   'deselect all cases and combos
       ret = SapModel.Results.Setup.DeselectAllCasesAndCombosForOutput()
   'set case selected for output
       ret = SapModel.Results.Setup.SetCaseSelectedForOutput("DEAD")
   'get section cut forces with analysis output convention
       ret = SapModel.Results.SectionCutAnalysis(NumberResults, SCut, LoadCase, StepType, StepNum, F1, F2, F3, M1, M2, M3)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalysisResults Interface
ETABSv1 Namespace